GNU gdb (GDB) 11.1
Copyright (C) 2021 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-w64-mingw32".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
--Type <RET> for more, q to quit, c to continue without paging--
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.exe...
(gdb) r
Starting program: E:\Git\c_activity_sets\set01\a.exe
[New Thread 5832.0x1da4]
warning: Can not parse XML library list; XML support was disabled at compile time       
enter the size5
enter the numbers6
enter the numbers7
enter the numbers8
enter the numbers9
enter the numbers20
the sum of 6 +7 +8 +9 +20 = 50[Thread 5832.0x1da4 exited with code 0]
[Inferior 1 (process 5832) exited normally]
(gdb) b 2
Breakpoint 1 at 0x7ff756b115f8: file .\problem08.c, line 8.
(gdb) r
Starting program: E:\Git\c_activity_sets\set01\a.exe
[New Thread 8120.0x3b98]

Thread 1 hit Breakpoint 1, 0x00007ff756b115f8 in main () at .\problem08.c:8
8       {
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) n
Program not restarted.
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) n
Program not restarted.
(gdb) l
3       int input_array_size();
4       void input_array(int n, int a[n]);
5       int sum_n_array(int n, int a[n]);
6       void output(int n, int a[n],int sum);
7       int main()
8       {
9           int n;
10          n=input_array_size();
11          int a[n],sum;
12          input_array(n,a);
(gdb) step
10          n=input_array_size();
(gdb) step
input_array_size () at .\problem08.c:20
20          printf("enter the size");
(gdb) n
enter the size21            scanf("%d",&x);
(gdb) n
step
22          return x;
(gdb)
24      }
(gdb)
main () at .\problem08.c:11
11          int a[n],sum;
(gdb)
12          input_array(n,a);
(gdb) 
13          sum=sum_n_array(n,a);
(gdb)
14          output(n,a,sum);
(gdb)
the sum of 0 = 015          return 0;
(gdb)
16      }
(gdb)
0x00007ff756b113c1 in __tmainCRTStartup ()
(gdb) 
Single stepping until exit from function __tmainCRTStartup,
which has no line number information.
[Thread 8120.0x3b98 exited with code 0]
[Inferior 1 (process 8120) exited normally]
(gdb) s
The program is not being run.
(gdb) quit